In [11]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [12]:
import pandas as pd

In [13]:
import numpy as np

In [14]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [15]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [16]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [17]:
string_data[0] = None

In [18]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [19]:
from numpy import nan as NA

In [20]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [21]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [22]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA ,NA],[NA,NA,NA],[NA,6.5,3.]])

In [24]:
cleaned = data.dropna()

In [25]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [27]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [28]:
data[4] = NA

In [29]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [30]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7, 3))

In [32]:
df.iloc[:4, 1] = NA

In [33]:
df.iloc[:2, 2] = NA

In [34]:
df

          0         1         2
0  0.063034       NaN       NaN
1 -1.132206       NaN       NaN
2  0.309181       NaN -0.321613
3  0.455325       NaN  2.466097
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [35]:
df.dropna()

          0         1         2
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [36]:
df.dropna(thresh=2)

          0         1         2
2  0.309181       NaN -0.321613
3  0.455325       NaN  2.466097
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [37]:
df.fillna(0)

          0         1         2
0  0.063034  0.000000  0.000000
1 -1.132206  0.000000  0.000000
2  0.309181  0.000000 -0.321613
3  0.455325  0.000000  2.466097
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [38]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.063034  0.500000  0.000000
1 -1.132206  0.500000  0.000000
2  0.309181  0.500000 -0.321613
3  0.455325  0.500000  2.466097
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [39]:
_ = df.fillna(0, inplace=True)

In [40]:
df

          0         1         2
0  0.063034  0.000000  0.000000
1 -1.132206  0.000000  0.000000
2  0.309181  0.000000 -0.321613
3  0.455325  0.000000  2.466097
4 -2.633988  2.000755  1.664151
5  0.915224 -1.885633 -0.164207
6  2.095898  0.020528 -2.193211

In [41]:
df = pd.DataFrame(np.random.randn(6, 3))

In [42]:
df.iloc[2:, 1] = NA

In [43]:
df.iloc[4:, 2] = NA

In [44]:
df

          0         1         2
0  1.105100  0.598117 -0.553879
1 -1.452831 -1.404474  1.257400
2 -0.744226       NaN  0.876298
3 -0.349755       NaN -1.342862
4  1.461436       NaN       NaN
5 -1.633573       NaN       NaN

In [45]:
df.fillna(method='ffill')

          0         1         2
0  1.105100  0.598117 -0.553879
1 -1.452831 -1.404474  1.257400
2 -0.744226 -1.404474  0.876298
3 -0.349755 -1.404474 -1.342862
4  1.461436 -1.404474 -1.342862
5 -1.633573 -1.404474 -1.342862

In [46]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.105100  0.598117 -0.553879
1 -1.452831 -1.404474  1.257400
2 -0.744226 -1.404474  0.876298
3 -0.349755 -1.404474 -1.342862
4  1.461436       NaN -1.342862
5 -1.633573       NaN -1.342862

In [47]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [48]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
data = pd.DataFrame({'k1':['one','two'] *3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [50]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [51]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [52]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [53]:
data['v1'] = range(7)

In [54]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [55]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [56]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [57]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [58]:
meat_to_animal = { 'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig', 'nova lox': 'salmon'
}

In [59]:
lowercased = data['food'].str.lower()

In [60]:
lowercased = data['food'].str.lower()

In [61]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham': 'pig',
    'nova lox':'salmon'
}

In [62]:
lowercased = data['food'].str.lower()

In [63]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [64]:
import pandas as pd

In [65]:
import numpy as np

In [66]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham': 'pig',
    'nova lox':'salmon'
}

In [68]:
lowercased = data['food'].str.lower()

In [69]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [70]:
data['animal'] = lowercased.map(meat_to_animal)

In [71]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [72]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [73]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [74]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [76]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [77]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [78]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [79]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [80]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [81]:
transform = lambda x: x[:4].upper()

In [82]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [83]:
data.indx = data.index.map(transform)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [84]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [86]:
data.rename(index = {'Ohio':'INDIANA'},
           columns = {'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [87]:
data.rename(index = {'Ohio':'INDIANA'},inplace = True)

In [88]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [89]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [90]:
bins = [18,25,35,60,100]

In [91]:
cats = pd.cut(ages,bins)

In [92]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [93]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [94]:

cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [95]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [96]:
pd.cut(ages,[18,26,36,61,100],right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [97]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [98]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [99]:
data = np.random.rand(20)

In [100]:
pd.cut(data, 4, precision=2)

[(0.22, 0.43], (0.22, 0.43], (0.43, 0.64], (0.22, 0.43], (0.01, 0.22], ..., (0.01, 0.22], (0.64, 0.85], (0.22, 0.43], (0.01, 0.22], (0.64, 0.85]]
Length: 20
Categories (4, interval[float64]): [(0.01, 0.22] < (0.22, 0.43] < (0.43, 0.64] < (0.64, 0.85]]

In [101]:
data = np.random.randn(1000)

In [102]:
cats = pd.qcut(data, 4)

In [103]:
cats

[(0.683, 3.131], (0.683, 3.131], (0.683, 3.131], (-3.1999999999999997, -0.65], (-3.1999999999999997, -0.65], ..., (-0.65, 0.00732], (0.683, 3.131], (0.00732, 0.683], (0.00732, 0.683], (-3.1999999999999997, -0.65]]
Length: 1000
Categories (4, interval[float64]): [(-3.1999999999999997, -0.65] < (-0.65, 0.00732] < (0.00732, 0.683] < (0.683, 3.131]]

In [104]:
pd.value_counts(cats)

(0.683, 3.131]                  250
(0.00732, 0.683]                250
(-0.65, 0.00732]                250
(-3.1999999999999997, -0.65]    250
dtype: int64

In [105]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.24, 3.131], (1.24, 3.131], (0.00732, 1.24], (-1.187, 0.00732], (-3.1999999999999997, -1.187], ..., (-1.187, 0.00732], (0.00732, 1.24], (0.00732, 1.24], (0.00732, 1.24], (-3.1999999999999997, -1.187]]
Length: 1000
Categories (4, interval[float64]): [(-3.1999999999999997, -1.187] < (-1.187, 0.00732] < (0.00732, 1.24] < (1.24, 3.131]]

In [106]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [107]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.056271     0.006684     0.022469    -0.018945
std       1.014783     0.967333     1.015284     1.001451
min      -3.341280    -2.886610    -3.037792    -3.502526
25%      -0.651322    -0.665449    -0.638865    -0.632514
50%       0.053487     0.028636     0.064345    -0.011827
75%       0.774285     0.679902     0.670888     0.618641
max       3.452385     3.324415     3.070676     3.714191

In [108]:
col = data[2]

In [109]:
col[np.abs(col) > 3]

241    3.070676
355   -3.012841
953   -3.037792
Name: 2, dtype: float64

In [110]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -3.341280 -0.646131  2.579210  0.727253
137 -1.381705 -0.406263 -1.030612 -3.363926
241 -0.384221 -0.043793  3.070676 -1.345885
269 -1.515781 -0.518327  0.151550  3.714191
279 -0.422653 -0.229477 -0.483162  3.137075
320 -0.770765  3.095564  0.866736 -1.030649
341  3.085298  1.063271  0.006414  0.293776
355 -0.348653 -0.382050 -3.012841 -0.169321
429 -0.892595  3.324415  1.207692  1.726704
565  3.452385  0.922282 -0.443706  0.041592
811 -0.125858  0.211862  0.051192 -3.502526
911  1.642139  0.777026  0.124115  3.024156
953  0.703704  0.049781 -3.037792  0.631434

In [111]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [112]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.056075     0.006264     0.022449    -0.018954
std       1.012027     0.965972     1.014922     0.995755
min      -3.000000    -2.886610    -3.000000    -3.000000
25%      -0.651322    -0.665449    -0.638865    -0.632514
50%       0.053487     0.028636     0.064345    -0.011827
75%       0.774285     0.679902     0.670888     0.618641
max       3.000000     3.000000     3.000000     3.000000

In [113]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0 -1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4 -1.0 -1.0  1.0 -1.0

In [114]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [115]:
sampler = np.random.permutation(5)

In [116]:
sampler

array([4, 3, 1, 0, 2])

In [117]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [118]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [119]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
choices = pd.Series([5, 7, -1, 6, 4])

In [121]:
draws = choices.sample(n=10, replace=True)

In [122]:
draws

0    5
2   -1
3    6
1    7
2   -1
3    6
2   -1
1    7
2   -1
4    4
dtype: int64

In [123]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....:	'data1': range(6)})

In [124]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [125]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [126]:
df_with_dummy = df[['data1']].join(dummies)

In [127]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [128]:
mnames = ['movie_id', 'title', 'genres']

In [129]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
.....:	header=None, names=mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [130]:
 movies[:10]

NameError: name 'movies' is not defined

In [131]:
import pandas as pd

In [132]:
movies = pd.read_table('datasets/movielens/movies.dat',sep = '::', header = None, names = mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [133]:
movies[:10]

NameError: name 'movies' is not defined

In [134]:
val = 'a,b,	guido'

In [135]:
val.split(',')

['a', 'b', '\tguido']

In [136]:
pieces = [x.strip() for x in val.split(',')]

In [137]:
pieces

['a', 'b', 'guido']

In [138]:
first, second, third = pieces

In [139]:
first + '::' + second + '::' + third

'a::b::guido'

In [140]:
'::'.join(pieces)

'a::b::guido'

In [141]:
'guido' in val

True

In [142]:
val.index(',')

1

In [143]:
val.find(':')

-1

In [144]:
val.index(':')

ValueError: substring not found

In [145]:
val.count(',')

2

In [146]:
val.replace(',', '::')

'a::b::\tguido'

In [147]:
val.replace(',', '')

'ab\tguido'

In [148]:
import re

In [149]:
text = "foo	bar\t baz	\tqux"

In [150]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [151]:
regex = re.compile('\s+')

In [152]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [153]:
regex.findall(text)

['\t', '\t ', '\t\t']

In [154]:
regex.findall(text)

['\t', '\t ', '\t\t']

In [155]:
text = """Dave dave@google.com Steve steve@gmail.com
Rob rob@gmail.com Ryan ryan@yahoo.com """

In [156]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [157]:
regex.findall(text)

[' ', ' ', ' ', '\n', ' ', ' ', ' ', ' ']

In [158]:
m = regex.search(text)

In [159]:
 m

In [160]:
text[m.start():m.end()]

' '

In [161]:
print(regex.match(text))

None

In [162]:
print(regex.sub('REDACTED', text))

DaveREDACTEDdave@google.comREDACTEDSteveREDACTEDsteve@gmail.comREDACTEDRobREDACTEDrob@gmail.comREDACTEDRyanREDACTEDryan@yahoo.comREDACTED

In [163]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [164]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [165]:
m = regex.match('wesm@bright.net')

In [166]:
m.groups()

('wesm', 'bright', 'net')

In [167]:
 regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [168]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com Ryan Username: ryan, Domain: yahoo, Suffix: com

In [169]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
.....:	'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [170]:
data = pd.Series(data)

In [171]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [172]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [173]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [174]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [175]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [176]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [177]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [178]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [179]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object